ankrysm/esp32_ws2812/main/paint_pixel.c
/*
 * paint_pixel.c
 *
 *  Created on: 28.07.2022
 *      Author: andreas
 */

#include "esp32_ws2812.h"


// ****painting functions

//     LED-strip
//        ^
//        |
//      level sections
//        ^
//        |
//      color sections
//        ^
//        |
//      timing (change parameter for colors and level depending on the time)
//        ^
//        |
//      moving (change location and/or length depending on the time)
//
//              sec_pos                                                           sec_len
//                 +--->                                                        <----+
// leds:           |x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|
//                 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
// level sections: | lvl sec 1   |   lvl sec 2       |    lvl sec 3      |
//                 +-------------+-----------+-------+-------------------+-----+
// color sections: |    col sec 1            |          col sec2               |
//                 +-------------------------+---------------------------------+

//              sec_pos                                                           sec_len
//                 +--->                                                        <----+
//                 |                                                                 |->wrap to sec_pos or
//                 |                                         count down to sec_pos <-|
// leds:           |x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|
//                 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+---------+
// level sections: | lvl sec 1   |   lvl sec 2       |    lvl sec 3      | lvl sec 4           |
//                 +-------------+-----------+-------+-------------------+-----+---------------+
// color sections: |    col sec 1            |          col sec2               |   col sec 3   |
//                 +-------------------------+---------------------------------+---------------+


void led_sec_main(T_LED_SECTION *led_sec) {

	const int32_t max_cnt = 999999;

	const uint32_t init_lvl_sec = 0x0001;
	const uint32_t init_col_sec = 0x0002;

	uint32_t flags = init_lvl_sec | init_col_sec;

	// first level section
	T_LEVEL_SECTION *w_lvl_sec=led_sec->lvl_sec_list; // start with this
	int32_t lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : max_cnt;
	lvl_sec_spec w_lvl_spec = LVL_SEC_CONSTANT;

	// first color section
	T_COLOR_SECTION *w_col_sec = led_sec->col_sec_list;
	int32_t col_sec_cnt = w_col_sec ? w_col_sec->len : max_cnt;
	col_sec_spec w_col_spec = COL_SEC_CONSTANT;

	// position values
	if ( led_sec->d_sec_pos == 0)
		led_sec->d_sec_pos = 1;

	int32_t pos = 0; // (relative) position in the led section
	int32_t led_pos = led_sec->sec_pos; // position on the strip
	int32_t end_pos = led_sec->startpos + led_sec->len;

	// transient values for level section
	double w_lvl_f;
	double w_lvl_df;
	w_lvl_f = w_lvl_df = 0.0;

	// transient values for color section
	//T_COLOR_HSV w_col_hsv1={.h=0, .s=0, .v=0};
	//T_COLOR_HSV w_col_hsv2={.h=0, .s=0, .v=0};
	double w_col_h, w_col_s, w_col_v;
	double w_col_dh, w_col_ds, w_col_dv;
	w_col_h = w_col_s = w_col_v = w_col_dh = w_col_ds = w_col_dv = 0.0;

	// *** main loop ***
	for ( pos = 0; pos < led_sec->len; pos++) {
		// ******************************************
		// 1. ***  has to init? ***

		// *** color section init ***
		if ( flags & init_col_sec ) {
			// init color section
			if (w_col_sec) {

				// Start with HSV1
				w_col_h = 1.0 * w_col_sec->hsv1.h;
				w_col_s = 1.0 * w_col_sec->hsv1.s;
				w_col_v = 1.0 * w_col_sec->hsv1.v;
				w_col_dh = w_col_ds = w_col_dv = 0.0;

				w_col_spec = w_col_sec->spec;
				switch ( w_col_spec  & SEC_SPEC_MASK) {
				case COL_SEC_CONSTANT:
					break;

				case COL_SEC_LINEAR:
					w_col_dh = 1.0 * (w_col_sec->hsv2.h - w_col_sec->hsv1.h) / w_col_sec->len;
					w_col_ds = 1.0 * (w_col_sec->hsv2.s - w_col_sec->hsv1.s) / w_col_sec->len;
					w_col_dv = 1.0 * (w_col_sec->hsv2.v - w_col_sec->hsv1.v) / w_col_sec->len;
					break;

				case COL_SEC_EXP:
					// TODO change from linear (this) to exp:
					w_col_dh = 1.0 * (w_col_sec->hsv2.h - w_col_sec->hsv1.h) / w_col_sec->len;
					w_col_ds = 1.0 * (w_col_sec->hsv2.s - w_col_sec->hsv1.s) / w_col_sec->len;
					w_col_dv = 1.0 * (w_col_sec->hsv2.v - w_col_sec->hsv1.v) / w_col_sec->len;
					break;

				case COL_SEC_RAINBOW:
					// saturation always 100%
					w_col_s = 100.0;

					// hue over 360 degrees
					w_col_dh = 360.0 / w_col_sec->len;
					// saturation and value constant
					w_col_ds = 0.0;
					w_col_dv = 0.0;
					break;

				case COL_SEC_SPARKLE:
					sparkle_init(w_col_sec);
					break;

				default:
					ESP_LOGE(__func__, "NYI %d", w_lvl_sec->spec);
					// todo some defaults
				}
			} else {
				w_col_spec = COL_SEC_CONSTANT;
			}

			flags &= ~init_col_sec;
		}
		// *** level section init ***
		if ( flags & init_lvl_sec ) {
			// init level section
			if (w_lvl_sec) {
				w_lvl_spec = w_lvl_sec->spec;
				switch(w_lvl_spec & SEC_SPEC_MASK) {
				case LVL_SEC_CONSTANT:
					// w_f as constant factor
					w_lvl_f = 1.0 * w_lvl_sec->lvl1 / 100.0;
					w_lvl_df = 0.0; // not used
					break;
				case LVL_SEC_LINEAR:
					// w_lvl_df as constant increment,
					// example: if lvl2-lvl1 = 100 % and len = 4
					// use 25% 50% 75% 100%, not start with 0%
					w_lvl_df = 1.0 *(w_lvl_sec->lvl2 - w_lvl_sec->lvl1) / w_lvl_sec->len;
					w_lvl_f = w_lvl_df;
					break;
				case LVL_SEC_EXP:
					// w_f as increasing factor, doubled each cycle
					// example: if lvl2 - lvl1 is 100% and len is 4
					// use 12,5%, 25%, 50% 100%
					w_lvl_f = 1.0 / pow(2.0, (w_lvl_sec->len-1));
					w_lvl_df = 0.0; // not used
					break;
				case LVL_SEC_SPARKLE:
					// TODO
					w_lvl_f = 1.0;
					w_lvl_df = 0.0;
					break;
				default:
					ESP_LOGE(__func__, "NYI %d", w_lvl_sec->spec);
					w_lvl_f = 1.0;
					w_lvl_df = 0.0;
				}
			} else {
				w_lvl_spec =  LVL_SEC_CONSTANT;
				w_lvl_f = 1.0;
				w_lvl_df = 0.0;
			}
			flags &= ~init_lvl_sec;
		}
		// *** End of init ****************************************
		// ********************************************************

