ankrysm/esp32_ws2812/main/paint_pixel.c
		// 2. *** make color and level for one pixel
		// color from color section with brightness from level section
		// the color for a single pixel
		T_COLOR_HSV hsv={.h=0, .s=0, .v=0};
		T_COLOR_RGB rgb={.r=0,.g=0,.b=0};
		hsv.h = w_col_h;
		hsv.s = w_col_s;
		hsv.v = w_col_v;

		c_hsv2rgb(&hsv, &rgb);
		rgb.r = rgb.r * w_lvl_f;
		rgb.r = rgb.r * w_lvl_f;
		rgb.r = rgb.r * w_lvl_f;

		// 3. *** set the color
		if ( led_pos >=0 && led_pos < get_numleds()) {
			strip_set_pixel(led_pos, &rgb);
		}

		// 4. **** calculate color parameter for next cycle
		switch ( w_col_spec  & SEC_SPEC_MASK) {
		case COL_SEC_CONSTANT:
			break;

		case COL_SEC_LINEAR:
			w_col_h += w_col_dh;
			w_col_s += w_col_ds;
			w_col_v += w_col_dv;
			break;

		case COL_SEC_EXP:
			// TODO another calculation for real exponential values instead of this linear needed
			w_col_h += w_col_dh;
			w_col_s += w_col_ds;
			w_col_v += w_col_dv;
			break;

		case COL_SEC_RAINBOW:
			w_col_h += w_col_dh;
			w_col_s += w_col_ds;
			w_col_v += w_col_dv;
			break;

		case COL_SEC_SPARKLE:
			// choose random position for a spot and a random color between hsv1 and hsv2
			// with a random life time
			sparkle_get(w_col_sec, pos);
			break;
		default:
			ESP_LOGE(__func__, "NYI %d", w_lvl_sec->spec);
		}

		// * 5. *** calculate level parameter for next
		switch(w_lvl_spec & SEC_SPEC_MASK) {
		case LVL_SEC_CONSTANT:
			// w_f as constant factor
			break;

		case LVL_SEC_LINEAR:
			w_lvl_f += w_lvl_df;
			break;

		case LVL_SEC_EXP:
			w_lvl_f = 2 * w_lvl_f;
			break;

		case LVL_SEC_SPARKLE:
			// TODO
			//w_lvl_f = 1.0;
			//w_lvl_df = 0.0;
			break;
		default:
			ESP_LOGE(__func__, "NYI %d", w_lvl_sec->spec);
		}

		// 6. *** next position
		led_pos+= led_sec->d_sec_pos;

		// 7. check for section border
		int stop_working = 0;
		if ( led_pos >= end_pos ) {
			switch (led_sec->spec & SEC_SPEC_MASK ) {
			case LED_SEC_NO_WRAP:
				stop_working = 1;
				// stop
				break;
			case LED_SEC_WRAP:
				// continue with first position
				led_pos = led_sec->startpos;
				break;
			case LED_SEC_BOUNCE:
				// stop working but change direction of pos
				led_sec->d_sec_pos = - led_sec->d_sec_pos;
				break;
			default:
				ESP_LOGE(__func__, "led_sec_spec %d NYI", led_sec->spec);
			}

		} else if (led_pos < led_sec->startpos) {
			switch (led_sec->spec & SEC_SPEC_MASK ) {
			case LED_SEC_NO_WRAP:
				stop_working = 1;
				// stop
				break;
			case LED_SEC_WRAP:
				// continue with first position
				led_pos = led_sec->startpos + led_sec->len;
				break;
			case LED_SEC_BOUNCE:
				// stop working but change direction of pos
				led_sec->d_sec_pos = - led_sec->d_sec_pos;
				break;
			default:
				ESP_LOGE(__func__, "led_sec_spec %d NYI", led_sec->spec);
			}
		}
		if ( stop_working ) {
			break;
		}

		// 8. *** check for a next section ***
		// level section
		if ( pos >= lvl_sec_cnt) {
			// take the next level section
			w_lvl_sec = w_lvl_sec->nxt;
			if ( w_lvl_sec) {
				lvl_sec_cnt += w_lvl_sec->len;
			} else {
				lvl_sec_cnt = max_cnt; // not reached
			}
			flags |= init_lvl_sec;
		}
		// color section
		if ( pos >= col_sec_cnt) {
			// take the next level section
			w_col_sec = w_col_sec->nxt;
			if ( w_col_sec) {
				col_sec_cnt += w_col_sec->len;
			} else {
				col_sec_cnt = max_cnt; // not reached
			}
			flags |= init_col_sec;
		}

	} // for
}

//  number of sparkles = 5
//  width = 3: .|X|.
//  .|X|.       .|X|.           .|X|.     .|X|.     .|X|.
// |x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|x|
//   |                 |                             |
//  min pos        center pos                    max pos
// timing: if a sparkle disappeared create a new one
void sparkle_init(T_COLOR_SECTION *col_sec) {
}

void sparkle_get(T_COLOR_SECTION *col_sec, uint32_t pos, T_COLOR_HSV *hsv) {

}




/************************************************************************
 * Level funktions
 ************************************************************************/

/*
// constant
static void lvl_sec_constant(T_LEVEL_SECTION *lvlsec,  T_COLOR_RGB *rgb) {
	double f = lvlsec->w_f * lvlsec->w_timf;
	rgb->r = f * rgb->r;
	rgb->g = f * rgb->g;
	rgb->b = f * rgb->b;
}

// linear transition
static void lvl_sec_linear(T_LEVEL_SECTION *lvlsec, T_COLOR_RGB *rgb) {
	double f = lvlsec->w_f * lvlsec->w_timf;
	rgb->r = f * rgb->r;
	rgb->g = f * rgb->g;
	rgb->b = f * rgb->b;

	lvlsec->w_f +=lvlsec->w_df;
}

// exponential transition
static void lvl_sec_exp(T_LEVEL_SECTION *lvlsec, T_COLOR_RGB *rgb) {
	double f = lvlsec->w_f * lvlsec->w_timf;
	rgb->r = f * rgb->r;
	rgb->g = f * rgb->g;
	rgb->b = f * rgb->b;

	lvlsec->w_f  = 2.0 * lvlsec->w_f;
}


static void lvl_sec_sparkle(T_LEVEL_SECTION *lvlsec, T_COLOR_RGB *rgb) {
	rgb->r = lvlsec->w_f * rgb->r;
	rgb->g = lvlsec->w_f * rgb->g;
	rgb->b = lvlsec->w_f * rgb->b;
}
*/

/*

// ******* main level paint function ******************
// ******* called for a single pixel at positoin lvl_sec_pos
static void lvl_sec_main(T_LEVEL_SECTION *lvlsec, int32_t lvl_sec_pos, T_COLOR_RGB *rgb) {

	T_COLOR_RGB lrgb = {.r=0, .g=0, .b=0};
	if ( rgb ) {
		if ( lvlsec ) {
			double f = lvlsec->w_f;
			switch ( lvlsec->spec ) {
			case LVL_SEC_CONSTANT:
				//lvl_sec_constant(lvlsec, rgb);
				break;
			case LVL_SEC_LINEAR:
				//lvl_sec_linear(lvlsec, rgb);
				lvlsec->w_f +=lvlsec->w_df;
				break;
			case LVL_SEC_EXP:
				//lvl_sec_exp(lvlsec, rgb);
				lvlsec->w_f  = 2.0 * lvlsec->w_f;
				break;
			case LVL_SEC_SPARKLE:
				//lvl_sec_sparkle(lvlsec, rgb);
				// TODO
				break;
			default:
				ESP_LOGE(__func__, "NYI %d", lvlsec->spec);
			}
			f = f * lvlsec->w_timf;
			lrgb.r = rgb->r * f;
		}
	}

	if ( lvl_sec_pos >= 0 && lvl_sec_pos < get_numleds()) {
		// only in the visible range
		strip_set_pixel(lvl_sec_pos, &lrgb);
	}
}

*/
// ***** init functions

/*
static void lvl_sec_constant_init(T_LEVEL_SECTION *lvlsec, int32_t w_pos) {
	// w_f as constant factor
	lvlsec->w_f = 1.0 * lvlsec->lvl1 / 100.0;
	lvlsec->w_df = 0.0; // not used
}

static void lvl_sec_linear_init(T_LEVEL_SECTION *lvlsec, int32_t lvl_sec_pos) {
	if (lvlsec->len <1) {
		lvlsec->w_f = 0.0;
		ESP_LOGE(__func__,"lvlsec->len <1!");
		return;
	}
	// w_df as constant increment,
	// if lvl2-lvl1 = 100 % and len = 4
	// use 25% 50% 75% 100%, not start with 0%
	lvlsec->w_df = 1.0 *(lvlsec->lvl2 - lvlsec->lvl1) / lvlsec->len;
	lvlsec->w_f = lvlsec->w_df;
}

static void lvl_sec_exp_init(T_LEVEL_SECTION *lvlsec, int32_t lvl_sec_pos) {

