ankrysm/esp32_ws2812/main/paint_pixel.c
	lvlsec->w_df = 0.0; // not used

	if (lvlsec->len <1){
		lvlsec->w_f = 0.0;
		ESP_LOGE(__func__,"lvlsec->len <1!");
		return;
	}

	// w_f as increasing factor, doubled each cycle
	// if lvl2 - lvl1 is 100% and len is 4
	// use 12,5%, 25%, 50% 100%
	lvlsec->w_f = 1.0 / pow(2.0, (lvlsec->len-1));
}

static void lvl_sec_sparkle_init(T_LEVEL_SECTION *lvlsec, int32_t lvl_sec_pos) {
	lvlsec->w_f = 1.0; // todo
}
*/

/*
// ***** main init function  *****
// ***** called for a range  *****
static void lvl_sec_main_init(T_LEVEL_SECTION *lvl_sec_list, int32_t lvl_sec_pos) {
	if ( !lvl_sec_list ) {
		ESP_LOGE(__func__,"missing lvl_sec_list!");
		return;
	}

//	int32_t pos = lvl_sec_pos;
	for (T_LEVEL_SECTION *sec = lvl_sec_list; sec; sec = sec->nxt) {
		sec->w_f = 1.0;
		sec->w_df = 0.0;
		sec->w_timf = 1.0; // will be change in timing control

		if (sec->len <1) {
			// non visible
			ESP_LOGI(__func__,"lvlsec->len <1!");
			continue;
		}
		switch ( sec->spec ) {
		case LVL_SEC_CONSTANT:
			//lvl_sec_constant_init(sec, pos);
			// w_f as constant factor
			sec->w_f = 1.0 * sec->lvl1 / 100.0;
			break;

		case LVL_SEC_LINEAR:
			//lvl_sec_linear_init(sec, pos);
			// w_df as constant increment,
			// example: if lvl2-lvl1 = 100 % and len = 4
			// use 25% 50% 75% 100%, not start with 0%
			sec->w_df = 1.0 *(sec->lvl2 - sec->lvl1) / sec->len;
			sec->w_f = sec->w_df;
			break;

		case LVL_SEC_EXP:
			//lvl_sec_exp_init(sec, pos);
			// w_f as increasing factor, doubled each cycle
			// if lvl2 - lvl1 is 100% and len is 4
			// use 12,5%, 25%, 50% 100%
			sec->w_f = 1.0 / pow(2.0, (sec->len-1));
			break;

		case LVL_SEC_SPARKLE:
			// TODO lvl_sec_sparkle_init(sec, pos);
			break;

		default:
			ESP_LOGE(__func__, "NYI %d", sec->spec);
		}
//		pos += sec->len;
	}
}

*/
/************************************************************************
 * color section funktions
 ************************************************************************/

/*
// constant color in a range
static void col_sec_constant(T_COLOR_SECTION *col_sec, int32_t w_pos, int32_t w_len) {
	if ( w_len < 1)
		return;

	T_LEVEL_SECTION *w_lvl_sec=col_sec->lvl_sec_list; // start with this
	int32_t lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;

	int32_t endpos = w_pos + w_len;
	for ( int pos = w_pos; pos < col_sec->len; pos++) {

		lvl_sec_main( w_lvl_sec, pos, &(col_sec->w_rgb1));

		pos++;
		if ( pos >= endpos ) {
			if (col_sec->spec & COL_SPEC_WRAP){
				pos = w_pos; // from the beginning of the strip
			} else {
				break;
			}
		}

		lvl_sec_cnt--;
		if ( w_lvl_sec && lvl_sec_cnt <=0 ) {
			// next lvl section if exists
			w_lvl_sec = w_lvl_sec->nxt;
			lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;
		}
	}
}
*/

/*
// sets a color transition from rgb1 at wpos to rgb2 at w_pos + w_len
// if the wrap flag is set it starts from w_pos
static void col_sec_linear(T_COLOR_SECTION *col_sec, int32_t w_pos, int32_t w_len) {
	if ( w_len < 1)
		return;

	// because there are more then one level section, positions must be checkagainst level section len,
	// when reached the end take then next section
	T_LEVEL_SECTION *w_lvl_sec=col_sec->lvl_sec_list; // start with this
	int32_t lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;

	double dr,dg,db,r,g,b;
	T_COLOR_RGB *rgb1 = &(col_sec->w_rgb1);
	T_COLOR_RGB *rgb2 = &(col_sec->w_rgb2);

	r = rgb1->r;
	g = rgb1->g;
	b = rgb1->b;
	dr = 1.0 *(rgb2->r - rgb1->r) / w_len;
	dg = 1.0 *(rgb2->g - rgb1->g) / w_len;
	db = 1.0 *(rgb2->b - rgb1->b) / w_len;

	int32_t pos = w_pos;
	int32_t endpos = w_pos + w_len;
	for (int i=0; i < col_sec->len; i++) {
		r += dr;
		g += dg;
		b += db;
		/ *
		ESP_LOGI(__func__, "fade_in %d at %d, delta=%d: drgb=%d/%d/%d d=%.4f/%.4f/%.4f rgb=%.2f/%.2f/%.2f"
				,i, *pos, delta_pos
				,(rgb2->r - rgb1->r),(rgb2->g - rgb1->g),(rgb2->b - rgb1->b)
				,dr,dg,db
				,r,g,b
				);
		 * /
		T_COLOR_RGB rgb;
		rgb.r = r; rgb.g = g; rgb.b = b;

		lvl_sec_main(w_lvl_sec, pos, &rgb);

		if ( pos > 0 && pos < get_numleds()) {
			// only in the visible range
			strip_set_pixel(pos, &rgb);
		}

		pos++;
		if ( pos >= endpos ) {
			if (col_sec->spec & COL_SPEC_WRAP){
				pos = w_pos; // from the beginning of the strip
			} else {
				break;
			}
		}

		lvl_sec_cnt--;
		if ( w_lvl_sec && lvl_sec_cnt <=0 ) {
			// all positions used, go to the next level section
			w_lvl_sec = w_lvl_sec->nxt;
			lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;
		}
	}
}
*/

/*
static void col_sec_exp(T_COLOR_SECTION *colsec, int32_t w_pos, int32_t w_len) {
	// TODO
}
*/

/*
// based on HSV
static void col_sec_rainbow(T_COLOR_SECTION *col_sec, int32_t w_pos, int32_t w_len) {
	if ( w_len < 1)
		return;

	// because there are more then one level section, positions must be checkagainst level section len,
	// when reached the end take then next section
	T_LEVEL_SECTION *w_lvl_sec=col_sec->lvl_sec_list; // start with this
	int32_t lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;

	int32_t pos = w_pos;
	int32_t endpos = w_pos + w_len;
	for (int i=0; i < col_sec->len; i++) {
		T_COLOR_RGB rgb;
		T_COLOR_HSV hsv;
		hsv.h =

		lvl_sec_main(w_lvl_sec, pos, &rgb);

		if ( pos > 0 && pos < get_numleds()) {
			// only in the visible range
			strip_set_pixel(pos, &rgb);
		}

		pos++;
		if ( pos >= endpos ) {
			if (col_sec->spec & COL_SPEC_WRAP){
				pos = w_pos; // from the beginning of the strip
			} else {
				break;
			}
		}

		lvl_sec_cnt--;
		if ( w_lvl_sec && lvl_sec_cnt <=0 ) {
			// all positions used, go to the next level section
			w_lvl_sec = w_lvl_sec->nxt;
			lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;
		}

	}
}

*/

/*
static void col_sec_sparkle(T_COLOR_SECTION *colsec, int32_t w_pos, int32_t w_len) {
	// TODO
}
*/


/*
// ***** main color function ******
// location dependend - sets the colors in a given range
static void col_sec_main(T_LED_SECTION *col_sec, int32_t w_pos, int32_t w_len) {
	if ( w_len < 1)
		return;

	// because there are more then one level section, positions must be checkagainst level section len,
	// when reached the end take then next section
	T_LEVEL_SECTION *w_lvl_sec=col_sec->lvl_sec_list; // start with this
	int32_t lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;

	double dr,dg,db,r,g,b;
	T_COLOR_RGB *rgb1 = &(col_sec->w_rgb1);
	T_COLOR_RGB *rgb2 = &(col_sec->w_rgb2);

