ankrysm/esp32_ws2812/main/paint_pixel.c
	r = rgb1->r;
	g = rgb1->g;
	b = rgb1->b;
	dr = 1.0 *(rgb2->r - rgb1->r) / w_len;
	dg = 1.0 *(rgb2->g - rgb1->g) / w_len;
	db = 1.0 *(rgb2->b - rgb1->b) / w_len;

	int32_t pos = w_pos;
	int32_t endpos = w_pos + w_len;
	for (int i=0; i < col_sec->len; i++) {
		r += dr;
		g += dg;
		b += db;
		/ *
		ESP_LOGI(__func__, "fade_in %d at %d, delta=%d: drgb=%d/%d/%d d=%.4f/%.4f/%.4f rgb=%.2f/%.2f/%.2f"
				,i, *pos, delta_pos
				,(rgb2->r - rgb1->r),(rgb2->g - rgb1->g),(rgb2->b - rgb1->b)
				,dr,dg,db
				,r,g,b
				);
		 * /
		T_COLOR_RGB rgb;
		rgb.r = r; rgb.g = g; rgb.b = b;

		// -------------------------
		switch (colsec->spec) {
		case COL_SEC_CONSTANT:
			col_sec_constant(colsec, w_pos, w_len);
			break;
		case COL_SEC_LINEAR:
			col_sec_linear(colsec, w_pos, w_len);
			break;
		case COL_SEC_EXP:
			col_sec_linear(colsec, w_pos, w_len);
			//col_sec_exp(colsec, w_pos, w_len);
			break;
		case COL_SEC_RAINBOW:
			col_sec_rainbow(colsec, w_pos, w_len);
			break;
		case COL_SEC_SPARKLE:
			col_sec_sparkle(colsec, w_pos, w_len);
			break;
		default:
			ESP_LOGE(__func__, "NYI %d", colsec->spec);



		// --------------------------

		lvl_sec_main(w_lvl_sec, pos, &rgb);

		if ( pos > 0 && pos < get_numleds()) {
			// only in the visible range
			strip_set_pixel(pos, &rgb);
		}

		pos++;
		if ( pos >= endpos ) {
			if (col_sec->spec & COL_SPEC_WRAP){
				pos = w_pos; // from the beginning of the strip
			} else {
				break;
			}
		}

		lvl_sec_cnt--;
		if ( w_lvl_sec && lvl_sec_cnt <=0 ) {
			// all positions used, go to the next level section
			w_lvl_sec = w_lvl_sec->nxt;
			lvl_sec_cnt = w_lvl_sec ? w_lvl_sec->len : 0;
		}
	}


	switch (colsec->spec) {
	case COL_SEC_CONSTANT:
		col_sec_constant(colsec, w_pos, w_len);
		break;
	case COL_SEC_LINEAR:
		col_sec_linear(colsec, w_pos, w_len);
		break;
	case COL_SEC_EXP:
		col_sec_linear(colsec, w_pos, w_len);
		//col_sec_exp(colsec, w_pos, w_len);
		break;
	case COL_SEC_RAINBOW:
		col_sec_rainbow(colsec, w_pos, w_len);
		break;
	case COL_SEC_SPARKLE:
		col_sec_sparkle(colsec, w_pos, w_len);
		break;
	default:
		ESP_LOGE(__func__, "NYI %d", colsec->spec);
	}
}

*/

/************************************************************************
 * timing functions
 ************************************************************************/

/*
// **************** Level timing functions *****************************
static void tim_lvl_sec_constant(T_COLOR_SECTION *col_sec) {
	/ * is not necessary
	T_TIMING_LVL_SECTION *s = col_sec->tim_lvl_sec;
	if (!((s->spec) & TIM_LVL_SEC_INITIALIZED)) {
		// assign values only once
		if ( col_sec->lvl_sec) {
			for (T_LEVEL_SECTION *lsec = col_sec->lvl_sec; lsec; lsec = lsec->nxt) {
				lsec->lvl1 = s->lvl1;
				lsec->lvl2 = s->lvl2;
			}
		}
		// mark as initialized
		s->spec |= TIM_LVL_SEC_INITIALIZED;
	}
	 * /
}
*/


/*
static void tim_lvl_sec_linear(T_COLOR_SECTION *col_sec) {

	T_TIMING_LVL_SECTION *s = col_sec->tim_lvl_sec;
	if ( ! ((s->spec) & TIM_LVL_SEC_INITIALIZED)) {
		uint64_t p = get_event_timer_period(); // in ms
		if ( p == 0 ) {
			ESP_LOGE(__func__, "no timer period set");
			return;
		}
		// speed in (% / sec) converted to (% / ms)
		s->w_df = 1.0 *(s->lvl2 - s->lvl1) / (p * (s->speed / 1000.0));
		if ( s->w_df < 0 ) {
			s->w_f = 1.0;
		} else {
			s->w_f = 0.0;
		}
		s->spec |= TIM_LVL_SEC_INITIALIZED;
	}

	// sets the value
	if ( col_sec->lvl_sec) {
		for (T_LEVEL_SECTION *lsec = col_sec->lvl_sec; lsec; lsec = lsec->nxt) {
			lsec->w_timf = s->w_f;
		}
	}

	// get next value
	uint8_t ended = false;
	if ( !(s->spec & TIM_LVL_SEC_ENDED )) {
		s->w_f += s->w_df;
		if ( s->w_f < 0.0 ) {
			s->w_f = 0.0;
			ended = true;
		} else if ( s->w_f > 1.0 ) {
			s->w_f = 1.0;
			ended = true;
		}
	}

	if ( ended ) {
		// do repeat
		if ( s->repeat > 0 ) {
			(s->w_repeat)--;
			if ( s->w_repeat > 0) {
				ended = false;
			}
		}
		if ( ended ) {
			s->spec |= TIM_LVL_SEC_ENDED;
		} else {
			// start a new cycle
			if (s->spec & TIM_LVL_SEC_BOUNCE) {
				s->w_df = -1.0 * s->w_df;
			} else {
				if ( s->w_df < 0 ) {
					s->w_f = 1.0;
				} else {
					s->w_f = 0.0;
				}
			}
		}
	}
}

*/



/*
// ***************** color timing functions ************************************
static void tim_col_sec_constant(T_COLOR_SECTION *col_sec) {
	// nothing todo
}

// transition from color1 to color2 and back (if bounced)
static void tim_col_sec_linear(T_COLOR_SECTION *col_sec) {

	T_TIMING_COL_SECTION *cs = col_sec->tim_col_sec;
	if ( ! ((cs->spec) & TIM_COL_SEC_INITIALIZED)) {
		uint64_t p = get_event_timer_period(); // in ms
		if ( p == 0 ) {
			ESP_LOGE(__func__, "no timer period set");
			return;
		}

		// from hsv1 to hsv2 with the given percent speed
		// speed in (% / sec) converted to (% / ms)
		cs->w_df_h = 1.0 *(cs->hsv2.h - cs->hsv1.h) / (p * (cs->speed / 1000.0));
		if ( cs->w_df_h < 0.0 ) {cs->w_f_h = 1.0;} else {cs->w_f_h = 0.0;}

		cs->w_df_s = 1.0 *(cs->hsv2.s - cs->hsv1.s) / (p * (cs->speed / 1000.0));
		if ( cs->w_df_s < 0.0 ) {cs->w_f_s = 1.0;} else {cs->w_f_s = 0.0;}

		cs->w_df_v = 1.0 *(cs->hsv2.v - cs->hsv1.v) / (p * (cs->speed / 1000.0));
		if ( cs->w_df_v < 0.0 ) {cs->w_f_v = 1.0;} else {cs->w_f_v = 0.0;}

		cs->spec |= TIM_COL_SEC_INITIALIZED;
	}

	// sets the value
	if ( col_sec->lvl_sec) {
		for (T_LEVEL_SECTION *lsec = col_sec->lvl_sec; lsec; lsec = lsec->nxt) {
			lsec->w_timf = s->w_f;
		}
	}

	// get next value
	uint8_t ended = false;
	if ( !(s->spec & TIM_LVL_SEC_ENDED )) {
		s->w_f += s->w_df;
		if ( s->w_f < 0.0 ) {
			s->w_f = 0.0;
			ended = true;
		} else if ( s->w_f > 1.0 ) {
			s->w_f = 1.0;
			ended = true;
		}
	}

	if ( ended ) {
		// do repeat
		if ( s->repeat > 0 ) {
			(s->w_repeat)--;
			if ( s->w_repeat > 0) {
				ended = false;
			}
		}
		if ( ended ) {
			s->spec |= TIM_LVL_SEC_ENDED;
		} else {
			// start a new cycle
			if (s->spec & TIM_LVL_SEC_BOUNCE) {
				s->w_df = -1.0 * s->w_df;
			} else {
				if ( s->w_df < 0 ) {
					s->w_f = 1.0;
				} else {
					s->w_f = 0.0;
				}
			}
		}
	}
}


// *************** main timing function ***************************************
void tim_sec_main(T_COLOR_SECTION *col_sec, int32_t w_pos, int32_t w_len) {

	lvl_sec_main_init(col_sec->lvl_sec, w_pos);

	if ( col_sec->tim_lvl_sec) {
		T_TIMING_LVL_SECTION *ls = col_sec->tim_lvl_sec;
		tim_lvl_sec_spec spec = ls->spec & 0xFF; // ignore flags
		// calculate level timings
		switch ( spec ) {
		case TIM_LVL_SEC_CONSTANT:
			tim_lvl_sec_constant(col_sec);
			break;
		case TIM_LVL_SEC_LINEAR:
			tim_lvl_sec_linear(col_sec);
			break;
		case TIM_LVL_SEC_EXP:
			// TODO create a special exp function
			tim_lvl_sec_linear(col_sec);
			break;
		default:
			ESP_LOGE(__func__, "NYI %d", spec);
		}
	}

	if ( col_sec->tim_col_sec) {
		T_TIMING_COL_SECTION *cs = col_sec->tim_col_sec;
		tim_col_sec_spec spec = cs->spec;
		// TODO calculate color timings
		switch(spec) {
		case TIM_COL_SEC_CONSTANT:
			// nothing todo
			tim_col_sec_constant(col_sec);
			break;
		case TIM_COL_SEC_LINEAR:
			tim_col_sec_linear(col_sec);
			break;
		case TIM_COL_SEC_EXP:
			// TODO separate exp function needed
			tim_col_sec_linear(col_sec);
			break;
		case TIM_SEC_RAINBOW:
			break;
		default:
			ESP_LOGE(__func__, "NYI %d", spec);
		}
	}


	col_sec_main(col_sec, w_pos, w_len);
}

*/
